In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load
file_to_load = "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [3]:
cols = df.columns
cols

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [4]:
df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [5]:
# Total number of players is the unique values of screen name
unique_names = df["SN"].unique()
player_count = len (unique_names)
player_count

576

In [6]:
# Using a dict of lists to create DF
total_players_df = pd.DataFrame({
    "Total Players": [player_count]
})
total_players_df

   Total Players
0            576

In [7]:
# Purchasing Analysis (Total)
# Run basic calculations to obtain number of unique items, average price, number of purchases, total revenue
# Create a summary data frame to hold the results
# Optional: give the displayed data cleaner formatting
# Display the summary data frame

In [8]:
# Number of Unique Items is the length of unique items from 'Item Name'
unique_items = len (df["Item Name"].unique())
unique_items

179

In [9]:
# Average price is the man value of all prices
average_price=df["Price"].mean()
average_price

3.050987179487176

In [10]:
# Number of purchases is the length of purchase ID, each one of these is unique
number_purchases=len(df["Purchase ID"])
number_purchases

780

In [11]:
# Total revenue is the sum of all the prices
total_revenue=df["Price"].sum()
total_revenue

2379.77

In [12]:
# Create a Summary DataFrame using a dictionary of lists
summary_df = pd.DataFrame({
    "Unique Items": [unique_items],
    "Average Price": [average_price],
    "Number of Purchases": [number_purchases],
    "Total Revenue": [total_revenue]
})
summary_df

   Unique Items  Average Price  Number of Purchases  Total Revenue
0           179       3.050987                  780        2379.77

In [13]:
### Come back to formatting

In [14]:
summary_df.dtypes

Unique Items             int64
Average Price          float64
Number of Purchases      int64
Total Revenue          float64
dtype: object

In [15]:
# Gender Demographics
# Percentage and Count of Male Players
# Percentage and Count of Female Players
# Percentage and Count of Other / Non-Disclosed

In [16]:
df["Gender"].unique()

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [17]:
# Create a dataframe that locs in the columns I'm interested in (SN and gender)
SN_gender_df=df.loc[:,["SN", "Gender"]]
SN_gender_df.head()

              SN Gender
0        Lisim78   Male
1    Lisovynya38   Male
2     Ithergue48   Male
3  Chamassasya86   Male
4      Iskosia90   Male

In [18]:
# Duplicates of SN in here
SN_gender_df.count()

SN        780
Gender    780
dtype: int64

In [19]:
# Proof of duplicates, values greater than in starter jupyter notebook
SN_gender_df["Gender"].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [20]:
# Dropping duplicates from screen name columns
SN_gender_df = SN_gender_df.drop_duplicates( "SN", keep="last")


# Value counts of gender in this dataframe will return number of M, F and O with no duplicates
gender_totals = SN_gender_df["Gender"].value_counts()
gender_totals

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [21]:
# Calculating the percentage of each as a comparison to total players
gender_percentages = (gender_totals / player_count)*100
gender_percentages

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [22]:
# Create DF 
gender_demographics_df = pd.DataFrame({
    "Total Count": gender_totals,
    "Percentage of Players": gender_percentages
})
gender_demographics_df

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [23]:
### Come back to formatting

In [24]:
# Purchasing Analysis (Gender)
# Run basic calculations to obtain purchase count, avg. purchase price, total purchase value, avg. purchase total per person - all by gender
# Create a summary data frame to hold the results
# Optional: give the displayed data cleaner formatting
# Display the summary data frame

In [25]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [26]:
# Interested in gender, price. Create DF containing these
price_gen_df = df.loc[:,["Gender", "Price"]]
price_gen_df.head()

  Gender  Price
0   Male   3.53
1   Male   1.56
2   Male   4.88
3   Male   3.27
4   Male   1.44

In [27]:
# Groupby gender
grouped_gender = price_gen_df.groupby(["Gender"])
# Need to apply aggregates to the groupby

In [28]:
# Calculates average purchase price by gender
av_purch_price = grouped_gender.mean()
av_purch_price

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [29]:
# Extracting just price column
av_purch_price = av_purch_price["Price"]
av_purch_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [30]:
# Purchase count is just total number of purchases for each gender, can use count function
purch_count = grouped_gender.count()
purch_count

                       Price
Gender
Female                   113
Male                     652
Other / Non-Disclosed     15

In [31]:
# Extracting just price column
purch_count = purch_count["Price"]
purch_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [32]:
# Total purchase value is the sum of of the prices
total_purch_value = grouped_gender.sum()
total_purch_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [33]:
# Extracting just price column
total_purch_value = total_purch_value["Price"]
total_purch_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [34]:
# Avg Total Purchase per Person = total purchase value divided by total number of that gender
av_total_purch_pper = total_purch_value / gender_demographics_df["Total Count"]
av_total_purch_pper

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [35]:
# Create a summary data frame to hold the results

purch_analysis_gender_df = pd.DataFrame({
    "Purchase Count": purch_count,
    "Average Purchase Price": av_purch_price,
    "Total Purchase Value": total_purch_value,
    "Avg Total Purchase per Person": av_total_purch_pper
})
purch_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [36]:
### Come back to formatting

In [37]:
# Age Demographics
# Establish bins for ages
# Categorize the existing players using the age bins. Hint: use pd.cut()
# Calculate the numbers and percentages by age group
# Create a summary data frame to hold the results
# Optional: round the percentage column to two decimal points
# Display Age Demographics Table

In [38]:
# Create a df with columns interested in - age and screen name
age_df = df.loc[:,["SN", "Age"]]
age_df.count()

SN     780
Age    780
dtype: int64

In [39]:
# Drop the duplicate screen names
age_df = age_df.drop_duplicates("SN", keep="last")
print(age_df.count())
age_df.head()

SN     576
Age    576
dtype: int64

              SN  Age
1    Lisovynya38   40
2     Ithergue48   24
3  Chamassasya86   24
4      Iskosia90   23
6      Itheria73   36

In [40]:
# For reference, max age so know what value last bin should take
print(age_df["Age"].max())
print(age_df["Age"].min())

45
7

In [41]:
# Create the bins in which Data will be held, need 8 so 9 numbers in brackets
bins = [0, 9, 14, 19, 24, 29, 34, 39, 50]

# Create labels for these bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-38", "40+"]

In [42]:
# Slice the data and place it into bins
pd.cut(age_df["Age"], bins, labels=group_labels)

1        40+
2      20-24
3      20-24
4      20-24
6      35-38
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 576, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-38 < 40+]

In [43]:
# Place the data series into a new column inside of the DataFrame
age_df["Age Groups"]=pd.cut(age_df["Age"], bins, labels=group_labels)
age_df

                SN  Age Age Groups
1      Lisovynya38   40        40+
2       Ithergue48   24      20-24
3    Chamassasya86   24      20-24
4        Iskosia90   23      20-24
6        Itheria73   36      35-38
..             ...  ...        ...
775     Aethedru70   21      20-24
776         Iral74   21      20-24
777     Yathecal72   20      20-24
778        Sisur91    7        <10
779      Ennrian78   24      20-24

[576 rows x 3 columns]

In [44]:
# Total count of each age group is the value count of that column
age_count=age_df["Age Groups"].value_counts()
age_count

20-24    258
15-19    107
25-29     77
30-34     52
35-38     31
10-14     22
<10       17
40+       12
Name: Age Groups, dtype: int64

In [45]:
# Percentage of players in each age group is is count divide by total players calculated earlier
age_percentages = (age_count / player_count)*100
age_percentages

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-38     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age Groups, dtype: float64

In [46]:
# Create df
age_demographics_df = pd.DataFrame({
    "Total Count": age_count,
    "Percentage of Players": age_percentages
})
age_demographics_df

       Total Count  Percentage of Players
20-24          258              44.791667
15-19          107              18.576389
25-29           77              13.368056
30-34           52               9.027778
35-38           31               5.381944
10-14           22               3.819444
<10             17               2.951389
40+             12               2.083333

In [47]:
# Using reindex to change order of index, 
age_demographics_df = age_demographics_df.reindex(index = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-38", "40+"])
age_demographics_df

       Total Count  Percentage of Players
<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-38           31               5.381944
40+             12               2.083333

In [48]:
### Come back to formatting

In [49]:
# Purchasing Analysis (Age)
# Bin the purchase_data data frame by age
# Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
# Create a summary data frame to hold the results
# Optional: give the displayed data cleaner formatting
# Display the summary data frame

In [50]:
# Interested in age, price. Create DF containing these
price_age_df = df.loc[:,["Age", "Price"]]
price_age_df.head()

   Age  Price
0   20   3.53
1   40   1.56
2   24   4.88
3   24   3.27
4   23   1.44

In [51]:
# Place the data series into a new column inside of the DataFrame
price_age_df["Age Groups"]=pd.cut(price_age_df["Age"], bins, labels=group_labels)
price_age_df.head()

   Age  Price Age Groups
0   20   3.53      20-24
1   40   1.56        40+
2   24   4.88      20-24
3   24   3.27      20-24
4   23   1.44      20-24

In [52]:
# Groupby Age Groups
grouped_age = price_age_df.groupby(["Age Groups"])
# Apply aggregates

In [53]:
# Purchase count is just total number of purchases for each age, can use count function on one column
purch_count_age = grouped_age.count()["Price"]
purch_count_age

Age Groups
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-38     41
40+       13
Name: Price, dtype: int64

In [54]:
# Average purchase price
av_purch_price_age = grouped_age.mean()["Price"]
av_purch_price_age

Age Groups
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-38    3.601707
40+      2.941538
Name: Price, dtype: float64

In [55]:
# Total Purchase Value
total_purch_value_age = grouped_age.sum()["Price"]
total_purch_value_age

Age Groups
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-38     147.67
40+        38.24
Name: Price, dtype: float64

In [56]:
# Average Total Purchase per Person
av_total_purch_pper_age = total_purch_value_age / age_demographics_df["Total Count"]
av_total_purch_pper_age

Age Groups
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-38    4.763548
40+      3.186667
dtype: float64

In [57]:
# Create a summary data frame to hold the results

purch_analysis_age_df = pd.DataFrame({
    "Purchase Count": purch_count_age,
    "Average Purchase Price": av_purch_price_age,
    "Total Purchase Value": total_purch_value_age,
    "Avg Total Purchase per Person": av_total_purch_pper_age
})
purch_analysis_age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Groups,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-38,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [58]:
## Come back to formatting

In [59]:
# Top Spenders
# Run basic calculations to obtain the results in the table below
# Create a summary data frame to hold the results
# Sort the total purchase value column in descending order
# Optional: give the displayed data cleaner formatting
# Display a preview of the summary data frame

In [60]:
# Interested in screen name and price. Create DF containing these
SN_df = df.loc[:,["SN", "Price"]]
SN_df.head()

              SN  Price
0        Lisim78   3.53
1    Lisovynya38   1.56
2     Ithergue48   4.88
3  Chamassasya86   3.27
4      Iskosia90   1.44

In [61]:
# Group by screen name
SN_grouped_df = SN_df.groupby("SN")

In [62]:
# Next 4 steps same as other purchasing analysis parts
purch_count_SN = SN_grouped_df["Price"].count()
purch_count_SN.head()

SN
Adairialis76    1
Adastirin33     1
Aeda94          1
Aela59          1
Aelaria33       1
Name: Price, dtype: int64

In [63]:
av_purch_price_SN = SN_grouped_df["Price"].mean()
av_purch_price_SN.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [64]:
total_purch_value_SN = SN_grouped_df["Price"].sum()

print(total_purch_value_SN.max())
print(total_purch_value_SN.min())
total_purch_value_SN.head()

18.96
1.0

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [65]:
# Create a summary data frame to hold the results
top_spenders_df = pd.DataFrame({
    "Purchase Count": purch_count_SN,
    "Average Purchase Price": av_purch_price_SN,
    "Total Purchase Value": total_purch_value_SN,
})
top_spenders_df.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [66]:
top_spenders_df.dtypes

Purchase Count              int64
Average Purchase Price    float64
Total Purchase Value      float64
dtype: object

In [67]:
# Use sort_values function to pass in the column name which you want to sort the DF on with ascending = False
sorted_spenders_df = top_spenders_df.sort_values(by= 'Total Purchase Value' , ascending = False)
sorted_spenders_df.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [68]:
## Come back to formatting

In [69]:
# Most Popular Items
# Retrieve the Item ID, Item Name, and Item Price columns
# Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value
# Create a summary data frame to hold the results
# Sort the purchase count column in descending order
# Optional: give the displayed data cleaner formatting
# Display a preview of the summary data frame

In [70]:
# Create new df from original df
ID_df = df.loc[:,["Item ID", "Item Name", "Price"]]
ID_df.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [71]:
# Groupby item ID and name
ID_grouped = ID_df.groupby(["Item ID", "Item Name"])

In [72]:
# A count will return how many times each game was purchased
purch_count_MP = ID_grouped.count()
purch_count_MP.head()

                            Price
Item ID Item Name
0       Splinter                4
1       Crucifer                4
2       Verdict                 6
3       Phantomlight            6
4       Bloodlord's Fetish      5

In [73]:
# Item price is the sum divided by how many purchased
item_price = ID_grouped.sum() / purch_count_MP
item_price.head()

                             Price
Item ID Item Name
0       Splinter            1.2800
1       Crucifer            2.9425
2       Verdict             2.4800
3       Phantomlight        2.4900
4       Bloodlord's Fetish  1.7000

In [74]:
# Total purchase value is purch count * item price
total_purch_value_MP = purch_count_MP * item_price
total_purch_value_MP.head()

                            Price
Item ID Item Name
0       Splinter             5.12
1       Crucifer            11.77
2       Verdict             14.88
3       Phantomlight        14.94
4       Bloodlord's Fetish   8.50

In [75]:
# Create a summary data frame to hold the results
most_popular_df = pd.DataFrame({
    "Purchase Count": purch_count_MP["Price"],
    "Item Price": item_price["Price"],
    "Total Purchase Value": total_purch_value_MP["Price"]
})
most_popular_df.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50

In [76]:
# Use sort_values function to pass in the column name which you want to sort the DF on with ascending = False
sorted_popular_df = most_popular_df.sort_values(by= 'Total Purchase Value' , ascending = False)
sorted_popular_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [77]:
## Come back to formatting

In [78]:
# Most Profitable Items
# Sort the above table by total purchase value in descending order
# Optional: give the displayed data cleaner formatting
# Display a preview of the data frame

In [79]:
sorted_profitable_df = most_popular_df.sort_values(by= 'Total Purchase Value' , ascending = False)
sorted_profitable_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80